<?php
// +----------------------------------------------------------------------
// | RXThink框架 [ RXThink ]
// +----------------------------------------------------------------------
// | 版权所有 2017~2019 南京RXThink工作室
// +----------------------------------------------------------------------
// | 官方网站: http://www.rxthink.cn
// +----------------------------------------------------------------------
// | Author: 牧羊人 <rxthink@gmail.com>
// +----------------------------------------------------------------------

namespace app\common\behavior;

/**
 * 初始化基础配置行为
 * 
 * @author 牧羊人
 * @date 2019-04-24
 *
 */
class InitBase
{
    /**
     * 执行行为 run方法是Behavior唯一的接口
     *
     * @author 牧羊人
     * @date 2019-04-24
     */
    public function run()
    {
        // 安装系统直接return
        if (defined('SYSTEM_INSTALL')) return;
        
        // TODO...
    }
}